{"id": "f97b4a007d08a432", "site": "indeed", "job_url": "https://www.indeed.com/viewjob?jk=f97b4a007d08a432", "job_url_direct": "http://www.indeed.com/job/information-security-analystsr-information-security-analyst-f97b4a007d08a432", "title": "Information Security Analyst/Sr. Information Security Analyst", "company": "School Employees Retirement System of Ohio", "location": "Columbus, OH, US", "job_type": "fulltime", "date_posted": "2024-09-05", "salary_source": "direct_data", "interval": "yearly", "min_amount": "71460.0", "max_amount": "123270.0", "currency": "USD", "is_remote": "True", "job_level": "", "job_function": "", "company_industry": "", "listing_type": "", "emails": "hr@ohsers.org", "description": "The School Employees Retirement System of Ohio (SERS) is seeking an **Information Security Analyst or Sr. Information Security Analyst, based on experience.** We are looking for a person who is passionate about information security and extremely very detail oriented.\n\nThe desired candidate will have experience or training related to information security.\n\n**Requested Experience, Skills and Education**\n\n· Associates degree (A.A.) or higher in computer science or related field with;\n\n· Experience in information security roles, with a focus on data loss prevention, fraud detection, and insider threat mitigation.\n\n· Strong understanding of DLP technologies, including content inspection, data classification, and data encryption.\n\n· Experience with fraud detection techniques and tools, such as anomaly detection, machine learning, and behavioral analytics.\n\n· Understanding of insider threat monitoring and detection mechanisms, including user behavior analytics and privilege access management.\n\n· Knowledge of regulatory requirements and industry standards related to data protection, fraud prevention, and insider threat mitigation.\n\n· Excellent analytical and problem-solving skills, with attention to detail and the ability to think critically under pressure.\n\n· Strong communication and interpersonal skills, with the ability to effectively convey complex technical concepts to non-technical stakeholders.\n\n· Certifications in, or interest in pursuing, relevant industry certifications are highly desirable, such as:\n\n· Carnegie Mellon - SEI Certificate in Insider Threat Program Manager (ITPM),\n\n· Insider Threat Vulnerability Assessor (ITVA),\n\n· Insider Threat Program Evaluator (ITPE),\n\n· Certificate in Insider Risk Management and Mitigation,\n\n· SANS - SEC401/501, SEC504, SEC530, SEC566, SEC595 (combination of any of these) GIAC - GOSI, GMON, GCED, GCWN, GDSA, GISP, GCFR (combination of any of these),\n\n· Certified Counter-Insider Threat Professional (CCITP-F or CCITP-A)\n\n· Certified Information Systems Security Professional (CISSP), Certified Information Security Manager (CISM), Global Information Assurance Certification (GIAC), etc.\n\n· Experience with security tools and technologies, such as SIEM, data classification, data protection, endpoint detection and response, is a plus.\n\n· ***Equivalent combination of education, skills, and experience considered when evaluating candidates for the Information Security Analyst or Senior Information Security Analyst role.***\n\n**Location and Commitments**\n\n· Hybrid work environment, offering 2-work from home days, each week, after 30 days of employment, or once eligible.\n\n· Required onsite workdays take place in our office in downtown Columbus, with free parking.\n\n· Core business hours are 8 to 4:45 PM (40 hours per week) Monday through Friday.\n\nTo view the full job description and to apply, please visit https://www.ohsers.org/about-sers/careers-at-sers/\n\nSERS is a defined benefit public pension fund that provides retirement allowances, disability and survivor benefits, and access to health care coverage for the people who served our schools. Our members are school bus drivers, custodians, secretaries, cafeteria workers, teacher’s aides, administrative and support staff, treasurers, business managers, and school board members – anyone who works for a school or school system in a nonteaching position. Our office is located in Columbus, Ohio.\n\nSERS is an Equal Employment Opportunity Employer. We recruit, hire, train, and promote without discrimination due to age, race, color, religion, sex, sexual orientation, national origin, citizenship, disability, military leave or veteran status, genetic information, or any other status protected by applicable federal, state or local law.\n\nSERS is committed to ensuring all applicants can successfully submit an application for consideration. If you have a disability, and you wish to discuss potential accommodations to complete your application for employment, please send an email to hr@ohsers.org or call (614) 340-2255.\n\n**SERS does not accept unsolicited recruiter and agency resumes and will not pay fees to any third-party agency or company that does not have a signed agreement with SERS.**\n\nJob Type: Full-time\n\nPay: $71,460.00 - $123,270.00 per year\n\nBenefits:\n\n* Dental insurance\n* Flexible schedule\n* Health insurance\n* Paid time off\n* Parental leave\n* Vision insurance\n\nWork Location: In person", "company_url": "https://www.indeed.com/cmp/School-Employees-Retirement-System-of-Ohio-1", "company_url_direct": "http://ohsers.org/", "company_addresses": "", "company_num_employees": "", "company_revenue": "", "company_description": "", "logo_photo_url": "", "banner_photo_url": "", "ceo_name": "", "ceo_photo_url": ""}
{"id": "9d51f80c2334c33f", "site": "indeed", "job_url": "https://www.indeed.com/viewjob?jk=9d51f80c2334c33f", "job_url_direct": "http://www.indeed.com/job/help-desk-production-support-9d51f80c2334c33f", "title": "Help Desk Production Support", "company": "KWS Pvt. Ltd", "location": "Columbus, OH, US", "job_type": "contract", "date_posted": "2024-09-05", "salary_source": "direct_data", "interval": "hourly", "min_amount": "27.0", "max_amount": "29.0", "currency": "USD", "is_remote": "False", "job_level": "", "job_function": "", "company_industry": "", "listing_type": "", "emails": "", "description": "Job Title : Help Desk Production Support\n\nLocation: Columbus, OH (Onsite)\n\nMode: Contract\n\nRate: $27-30/hr on W2 Without benefits\n\nJob Description :\n\nJob responsibilities\n\n* Analyze and troubleshoot production application flows to ensure end-to-end application or infrastructure service delivery supporting the business operations of the firm\n* Identify trends and assist in the management of incidents, problems, and changes in support of full stack technology systems, applications, or infrastructure\n\nRequired qualifications, capabilities, and skills\n\n* 2+ years of experience or equivalent expertise troubleshooting, resolving, and maintaining information technology services\n* Knowledge of applications or infrastructure in a large-scale technology environment on premises or public cloud\n* Exposure to observability and monitoring tools and techniques\n* Familiarity with processes in scope of the Information Technology Infrastructure Library (ITIL) framework\n\nPreferred qualifications, capabilities, and skills\n\n* Knowledge\n\nJob Type: Contract\n\nPay: $27.00 - $29.00 per hour\n\nBenefits:\n\n* 401(k)\n* Dental insurance\n* Health insurance\n* Paid time off\n* Vision insurance\n\nSchedule:\n\n* 8 hour shift\n\nExperience:\n\n* Help desk Support: 5 years (Required)\n* Software troubleshooting: 3 years (Required)\n\nLocation:\n\n* Columbus, OH 43085 (Required)\n\nWork Location: In person", "company_url": "https://www.indeed.com/cmp/Kws-Pvt.-Ltd", "company_url_direct": "", "company_addresses": "", "company_num_employees": "", "company_revenue": "", "company_description": "", "logo_photo_url": "", "banner_photo_url": "", "ceo_name": "", "ceo_photo_url": ""}
{"id": "cee95e7fa46f8677", "site": "indeed", "job_url": "https://www.indeed.com/viewjob?jk=cee95e7fa46f8677", "job_url_direct": "https://careersatricoh.com/FO/P6IFK026203F3VBQB688NF6WN/components/details.html?jobId=16277&jobTitle=Customer%20Support%20Technician", "title": "Customer Support Technician", "company": "Ricoh", "location": "London, OH, US", "job_type": "", "date_posted": "2024-09-05", "salary_source": "direct_data", "interval": "yearly", "min_amount": "49702.0", "max_amount": "62934.0", "currency": "USD", "is_remote": "True", "job_level": "", "job_function": "", "company_industry": "", "listing_type": "", "emails": "", "description": "Change your job, change your workplace, change your future...\n\n\n**We are actively building diverse teams and welcome applications from everyone**\n\n\n\nRole: Customer Support Technician  \n\nLocated: London (WC2R 2ND)  \n\nShift Pattern: 37.5 hours per week on a shared rota between the hours of 8:00 and 18:00  \n\nPackage: Competitive Salary with excellent benefits\n\n  \n\n**About Ricoh:**\n\n\n\nRicoh is a global technology business. As a company born in print, we design and manufacture graphic solutions that transform communications. To keep up with the pace of change in the workplace, we have built an extensive portfolio of innovative, industry-leading digital services spanning everything from Cloud & IT infrastructure solutions to process automation tools.\n\n\n\nEverything we do is designed to help individuals achieve fulfilment through work. Through technology, we make work smarter and more creative. Enabling people to lead purposeful working lives and organisations to become more productive, sustainable and profitable.\n\n\n\n**Find out more about****Ricoh Today**\n\n  \n\n\nWhat you will be doing\n\n\nThe primary function is deskside support to the customer’s end users. This encompasses Hardware, Software and system administration. Defined as providing contracted IT support to ensure that the client’s staff are able to do their job in support of their organization’s commercial goals i.e., access, shared resources, configuration, software installations, intranet and internet access, document management, hardware break fix and smart hands.\n\n\n* To act upon Incidents and Service Requests assigned to you and your team in the ITSM toolset or equivalent ticketing system. To own end to end Incident and queue management, including 3rd party ticket management as well as requests for additional services hardware /software, system access, configuration, desk moves and setup, and support where IT presence is required.\n* To engage escalation policies and procedures in order to ensure adherence to contractual SLAs.\n* To contribute to Major Incident and emergency response for client site specific services\n* Contribute to escalated problem resolution by providing smart hands support to the business upon request to assist with restoration of services.\n* To identify opportunities to ‘Shift left’ to allow the Service Desk to perform more complex support activities\n* To create, review and update Knowledge Base articles and local site documentation, processes, and procedures\n* To provide technical troubleshooting under the guidance of 3rd line resolver groups for technologies such as Infrastructure devices, Network devices, and Communication Services\n* To be responsible for hardware asset management, stock control and regular audits, including the allocation of new starter equipment and updating Configuration Management Database. Collecting leaver equipment and updating Configuration Management Database and the fulfilment of disposal requests\n* To deliver support for the IT on site infrastructure, including Wi-Fi and LAN access, Voice and Video Conferencing, Meeting Room Booking Systems, for audio visual conference calls meetings plus the integration of MS Teams meetings and Cisco Webex, Zoom calls and print solutions\n* To provide event support (remote, on premise, and in 3rd party locations)\n\n\nYou will ideally have\n\n\n* Excellent problem-solving skills and the ability to follow instructions. To comprehend format and “jargon” within written technical information in the form of technical manuals and bulletins and relevant publications\n* Possesses excellent communication skills at all levels within the customer and organization\n* Possesses ability to work under own initiative in pressured situations to deliver the highest levels of customer satisfaction\n* Ability to understand user requirements relating to the customers IT infrastructure.\n* Possesses ability to make decisions independently and use good judgment when others should be involved.\n* ITIL Foundation – Desirable.\n* Good organizer, priority driven, and able to multitask to meet service priorities.\n* Methodical with attention to detail but prepared to meet customer expectations.\n* Communicate effectively with good customer focus.\n\n\nTechnical Knowledge\n\n\n* Mac Hardware\n* Mac OS Big Sur/Monterey/Ventura\n* Jamf – Apple Device Management\n* Windows 10/11\n* Active Directory/Group Policy\n* Microsoft Office 365\n* SharePoint/Collaboration toolsets\n* Windows Deployment Service\n* Knowledge of Industry leading switches and wireless networks, including Fibre.\n* Laptop and Desktop PC diagnosis.\n* Customer specific equipment, for example Tablets, Scanners, Servers, NAS\n\n  \n\n\nIn return for your commitment, you can expect\n\n\nWe’re looking for individuals with values and causes, strengths and weaknesses, passions and ideas. Bring your unique energy, and we’ll match it with opportunities to create the future.\n\n  \n\n\n**In return for your commitment, we can offer you:**\n\n\n* Flexible and hybrid working in line with role requirements\n* An inclusive workplace\n* Excellent package with solid basic, strong bonus and company benefits including:\n\t+ A competitive holiday entitlement, two days special leave per annum for volunteering, additional holiday purchase scheme\n\t+ Flexible retirement plan\n\t+ Wellbeing schemes to support your physical, emotional and financial health including Employee Assistance Programme, financial protection, life cover and will writing, medical protection, gym, travel and retail discounts, and more.\n\t+ Company car / car allowance (role-specific), cycle to work scheme\n* Career development and life-long learning opportunities\n* Opportunity to join a global company\n\n  \n\n\n**Life at Ricoh:**\n\n  \n\n\n**Ricoh’s Core Values**\n\n\n\nOur values encourage us to constantly improve and contribute to the wellbeing of all stakeholders, including our customers, employees and society.\n\n\n\nFor our leaders, we deliver training and mentorship to ensure our managers can positively contribute to our company culture, with inclusive behaviours that are aligned to our values.\n\n  \n\n\n**Be part of something bigger**\n\n\n\nOur approach to sustainability touches every part of our organisation: from manufacturing to distribution, business sites to recycling, and how we support our customers.\n\n\n\nBy working with Ricoh, you choose to work for a company that cares about its impact on the planet and takes steps to reduce it each year. We have a number of global sustainability accreditations. You can read more about our work toward the UN's 17 Sustainable Development Goals here.\n\n  \n\n\nWe are an equal opportunities employer\n\n\n**We are an equal opportunities employer**\n\n\n\nWe are open to discussing adjustments to the recruitment process if needed. No applicant or employee will be treated less favourably than another on the grounds of a protected characteristic which are defined as sex, sexual orientation, age, disability, gender reassignment, trade union membership or non-membership, marriage and civil partnership, pregnancy and maternity, race and religion or belief.\n\n\n\nStriving for inclusion and diversity isn’t just the right thing to do. Diverse approaches, perspectives and experiences make us more innovative, lead to better decisions and help us better understand the needs of our customers.\n\n  \n\nTo empower you to bring your full identity to work, we have employee-led affinity groups in LGBTQ+, gender and ethnicity that allow members to explore issues and challenges surrounding shared identities, experiences and beliefs.\n\n  \n\n\n\nClick here to learn more about life at Ricoh.\n\n\n\nFUNCTION### **IT**\n\nLOCATION### **London**\n\nCONTRACT TYPE### **Permanent**\n\nCLOSING DATE### **03-Oct-2024**", "company_url": "https://www.indeed.com/cmp/Ricoh", "company_url_direct": "https://www.ricoh.com", "company_addresses": "Tokyo", "company_num_employees": "10,000+", "company_revenue": "more than $10B (USD)", "company_description": "More than just a technology company, we are focused on how people access, share and use information.", "logo_photo_url": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b52cc5d69acaf44a7b4b00ba4e0322a8", "banner_photo_url": "https://d2q79iu7y748jz.cloudfront.net/s/_headerimage/1960x400/87fd8f10bf43cb968444ca458fb9eba1", "ceo_name": "Yoshinori Yamashita", "ceo_photo_url": "https://d2q79iu7y748jz.cloudfront.net/s/_ceophoto/512x512/8a31a12118ca8c089dd3c49de5dca5c9"}
{"id": "993d586bad78d40a", "site": "indeed", "job_url": "https://www.indeed.com/viewjob?jk=993d586bad78d40a", "job_url_direct": "https://dasstateoh.taleo.net/careersection/oh_ext/jobdetail.ftl?job=240008YH&tz=GMT-05%3A00&tzname=America%2FChicago", "title": "Hybrid - Software Development Specialist 4 (PN 20036298)", "company": "State of Ohio", "location": "Columbus, OH, US", "job_type": "fulltime", "date_posted": "2024-09-05", "salary_source": "direct_data", "interval": "hourly", "min_amount": "42.0", "max_amount": "62.0", "currency": "USD", "is_remote": "False", "job_level": "", "job_function": "", "company_industry": "Government", "listing_type": "", "emails": "EEO-DiversityAffairs@dodd.ohio.gov", "description": "**What will you do?**\n\n\n* Collaborates with IT Architecture staff, Chief Information Officer, and IT Managers to design innovative Azure container applications (ACA) using logic apps, APIs, microservice architecture, and MudBlazor in C# solutions aligning with the agency's requirements.\n* Contributes to the analysis of the solution design business case and authors portions of the solution business case.\n* Leads and facilitates discussions with the development team, product owners, and business SMEs on the best approach to implementing designs.\n* Leads design reviews, writes, and reviews departmental code and/or configuration.\n* Conducts detailed alternative analyses and determine end-user requirements.\n* Identifies root causes for incidents and issues, offering solutions to prevent future defects.\n* Provides post-production support for applications, including error handling, logging, load balancing, failover, and additional tasks.\n* Mentors development staff on standards, best practices, leadership, and excellence in development.\n\n**Why Work for the State of Ohio**\nAt the State of Ohio, we take care of the team that cares for Ohioans. We provide a variety of quality, competitive benefits to eligible full-time and part-time employees\\*. For a list of all the State of Ohio Benefits, visit our Total Rewards website! Our benefits package includes:\n\n\n* Medical Coverage\n* Free Dental, Vision and Basic Life Insurance premiums after completion of eligibility period\n* Paid time off, including vacation, personal, sick leave and 11 paid holidays per year\n* Childbirth, Adoption, and Foster Care leave\n* Education and Development Opportunities (Employee Development Funds, Public Service Loan Forgiveness, and more)\n* Public Retirement Systems (such as OPERS, STRS, SERS, and HPRS) & Optional Deferred Compensation (Ohio Deferred Compensation)\n\n\n* Benefits eligibility is dependent on a number of factors. The Agency Contact listed above will be able to provide specific benefits information for this position.\n\n**Qualifications**\n60 mos. combined work experience in any combination of the following: providing solutions design, developing project plans with project manager or recommending approach through defining tasks and/or leading meetings relating to programs for computer applications including 12 mos. work experience with Azure.  \n\n  \n\n* Or completion of associate core program in computer science or information systems **AND** 42 mos. combined work experience in any combination of the following: providing solutions design, developing project plans with project manager or recommending approach through defining tasks and/or leading meetings relating to programs for computer applications including 12 mos. work experience with Azure.\n\n  \n\n* Or completion of undergraduate core program in computer science or information systems **AND** 36 mos. combined work experience in any combination of the following: providing solutions design, developing project plans with project manager or recommending approach through defining tasks and/or leading meetings relating to programs for computer applications including 12 mos. work experience with Azure.\n\n  \n\n* Or equivalent of minimum class qualifications for employment noted above.\n\n  \n\n**Job Skills:** Software Development/Implementation\n**Technical Skills:** Information Technology, Technical Documentation\n\n\n**Professional Skills:** Collaboration, Growth Mindset, Managing Meetings, Developing Others, Continuous Improvement\n\n\n**Primary Technology:** Microsoft Azure (12 mos. experience required)\n\n\n*To request a reasonable accommodation due to disability, please contact ADA Coordinator Tamara Hairston at 614-466-2508 or by email at**EEO-DiversityAffairs@dodd.ohio.gov**.*\n\n**Supplemental Information*** Current Department of Developmental Disabilities OCSEA employees shall receive first consideration pursuant to Article 17 of the collective bargaining agreement.\n* Hourly wage will be paid at step 1, unless otherwise specified by collective bargaining agreement or rules outlined in the ORC/OAC.\n* The final candidate selected for the position will be required to undergo a criminal background check. Rule 5123-2-02, “Background Investigations for Employment,” outlines disqualifying offenses that will preclude an applicant from being employed by the Department of Developmental Disabilities.\n* No additional materials will be accepted after the closing date; in addition, you must clearly demonstrate how you meet minimum qualifications on your civil service application. Attachments to your civil service application are only supplemental and may not be considered.\n* **Applicants selected to move forward in the hiring process will be contacted to schedule a mandatory in-person written assessment at our central office location.**\n\n**ADA Statement**\nOhio is a Disability Inclusion State and strives to be a model employer of individuals with disabilities. The State of Ohio is committed to providing access and inclusion and reasonable accommodation in its services, activities, programs and employment opportunities in accordance with the Americans with Disabilities Act (ADA) and other applicable laws.\n\n**Drug-Free Workplace**\nThe State of Ohio is a drug-free workplace which prohibits the use of marijuana (recreational marijuana/non-medical cannabis). Please note, this position may be subject to additional restrictions pursuant to the State of Ohio Drug-Free Workplace Policy (HR-39), and as outlined in the posting.", "company_url": "https://www.indeed.com/cmp/State-of-Ohio", "company_url_direct": "https://ohio.gov/", "company_addresses": "Ohio", "company_num_employees": "10,000+", "company_revenue": "", "company_description": "More than just a job... #TeamOhio", "logo_photo_url": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bab252fc488b91e02208727c9c3c2cc0", "banner_photo_url": "https://d2q79iu7y748jz.cloudfront.net/s/_headerimage/1960x400/49726a6f3d0e08c16c4d6fb07f7b4035", "ceo_name": "Governor Mike DeWine", "ceo_photo_url": "https://d2q79iu7y748jz.cloudfront.net/s/_ceophoto/512x512/6b79610f72b0375b7fedaac578a6a152"}
{"id": "54e47f3ab61a09c1", "site": "indeed", "job_url": "https://www.indeed.com/viewjob?jk=54e47f3ab61a09c1", "job_url_direct": "https://osu.wd1.myworkdayjobs.com/OSUCareers/job/Columbus-Campus/Systems-Accessibility-Analyst-3_R113874", "title": "Systems Accessibility Analyst 3", "company": "The Ohio State University", "location": "Columbus, OH, US", "job_type": "fulltime", "date_posted": "2024-09-04", "salary_source": "direct_data", "interval": "yearly", "min_amount": "87400.0", "max_amount": "114900.0", "currency": "USD", "is_remote": "False", "job_level": "", "job_function": "", "company_industry": "Education And Schools", "listing_type": "", "emails": "", "description": "The Digital Accessibility Coordinator supports the College of Engineering in implementing accessibility policies, training for employees, and accessibility evaluation/testing for new and existing software and services and providing consultation about accessibility. The Digital Accessibility Coordinator will respond to College of Engineering accessibility related requests and will work with faculty and staff to reach and maintain accessibility standards in accordance with University policies. As an advocate for, and expert in accessibility, consult with vendors and department staff to help them determine how to make their products and services accessible; may participate in Request for Proposal (RFP) committees for third-party products and services; and contribute to the development and delivery of training in accessibility to departmental staff who create content, maintain websites, or develop applications. The Digital Accessibility Coordinator will maintain reports on evaluations conducted, retesting efforts, and requested exceptions; Serve as the resident expert for the College of Engineering on technical questions about digital accessibility and stay abreast of accessibility technology and trends both within the University, academia in general, and the IT industry; Acts as the liaison between the College and University in matters of accessibility; Works with other parts of the College of Engineering to increase awareness of accessibility.\n\n**The target hiring range for this job profile is $****87,400/$101,150/ $114,900** **. The actual salary paid to an individual will vary based on multiple factors, including but not limit to, education, years of experience, internal equity, etc.**\n\n\n**Education and Experience**\n\n**Required**\n\n\nBachelor's degree in Computer Science, Information Systems, Computer Engineering or similar area of study, or vocational or technical school degree or equivalent combination of education and experience.\n\n\n4 years of relevant experience providing direct IT support and building/maintaining relationships with customers,\n\n\nmanaging operations, front-line supervisor and/or individual contributors who exercise moderate independence in assignments.\n\n**Desired**\n\n\nAn advanced degree in Computer Science, Information Systems, Computer Engineer or similar area of study is desired.\n\n\nPreferred minimum of 4-8 years of relevant experience. OSU Accessibility Tester Certification strongly desired; CPACC or other relevant certification from the International Association of Accessibility Professionals strongly desired; 3-5 years’ experience in evaluating the accessibility of software, creating accommodation and remediation plans, and assisting design and development teams in remediating accessibility issues strongly desired; deep understanding of tools to aid in Accessibility evaluation; experience working with people with Disabilities; experience testing for and remediation of accessibility barriers in Web, Mobile, and Native applications; understanding of HTML, JavaScript, and CSS; experience using assistive technologies; understanding and passion for Accessibility issues; experience in regulatory compliance; significant knowledge of current and emerging accessible development practices and assistive technologies; fluency with disability law and regulation in the higher education context.\n\n\nRegular 40 First Shift", "company_url": "https://www.indeed.com/cmp/The-Ohio-State-University", "company_url_direct": "https://hr.osu.edu/careers/", "company_addresses": "1590 N. High St., Columbus, OH 43201", "company_num_employees": "10,000+", "company_revenue": "$5B to $10B (USD)", "company_description": "The Ohio State University, one of the biggest and most comprehensive universities in the country, creates experiences that bring together expertise, ideas and resources to improve communities locally", "logo_photo_url": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/37fb456dae2a57c93846e99561026ba8", "banner_photo_url": "https://d2q79iu7y748jz.cloudfront.net/s/_headerimage/1960x400/87c5c38fc951ec46153c2c21725cf2ae", "ceo_name": "Walter \"Ted\" Carter Jr.", "ceo_photo_url": ""}
